comand = input("Введите команду")
while comand != "выход":
    if comand == "стишок":
        print("Умеют же шутить ребята,")
        print("Хоть сказки впору им слагать:")
        print("Нужна хорошая зарплата!")
        print("Работу, чур, не предлагать.")
    if comand == "анекдот":
        print("Дорогая, наши отношения зашли в тупик.")
        print("Просто ты постоянно тупишь, дорогой.")
    if comand =="игра":
        print("обойдёшься,игры вредны для психики")
    else:
        print("Команда не найдена")
    comand=input("Введите команду")
