comand = input("Что вы хотите получить? ")
while comand != "ничего":
    if comand == "пожелание":
        print("С 8 марта всех девочек,девушек,женщин и бабушек.")
        print("Счастья им, здоровья и благополучия!")
        print("Чтобы на душе было спокойно")
        print("И поменьше забот во всем,")
        print("С праздником!!!")
    elif comand == "шутку":
        print("Дорогой, купи мне телефон")
        print("А как же тот другой,который у тебя есть?")
        print("Другой купит мне шубу.")
    elif comand =="подарок":
        print("Подарок ждёт вас пойзже")
    else:
        print("Ничего не найдено")
    comand=input("Что вы хотите получить? ")
